src/DataProcessors/АРМПлатежныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМПлатежныйКалендарь</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходаДохода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/DataProcessors/АРМПлатежныйКалендарь/Ext/ObjectModule.bsl
Функция СформироватьКалендарь(Период) Экспорт
	ДатаНачала = Период.ДатаНачала;
	ДатаОкончания = Период.ДатаОкончания;
		
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ПлатежныйКалендарь");  	
	
	ОбластьШапкаОсновная = Макет.ПолучитьОбласть("Шапка|Основная");
	ТабДок.Вывести(ОбластьШапкаОсновная);
	ТекДата = ДатаНачала;
	Пока ТекДата <= ДатаОкончания Цикл
		ОбластьШапкаДополнительная = Макет.ПолучитьОбласть("Шапка|Дополнительная"); 
		ОбластьШапкаДополнительная.Параметры.Дата = Формат(ТекДата, "ДФ=dd.MM.yy");
		ТабДок.Присоединить(ОбластьШапкаДополнительная);                           
		ТекДата = ТекДата + 86400;
	КонецЦикла;
	ОбластьСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
	ОбластьСтрокаОсновная.Параметры.ВидОперации = "Остаток на начало";
	
	ТабДок.Вывести(ОбластьСтрокаОсновная);
    // Заполняем первую строку - Остаток на начало.
	// Не придумал другого варианта, кроме запроса в цикле для этого.
    ТекДата = ДатаНачала;
	Пока ТекДата <= ДатаОкончания Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВзаиморасчетыОстатки.СуммаОстаток) КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.Взаиморасчеты.Остатки(&ДатаНачала, ) КАК ВзаиморасчетыОстатки";
		
		Запрос.УстановитьПараметр("ДатаНачала", ТекДата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		СуммаНачальныйОстаток = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СуммаНачальныйОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;
		КонецЦикла;
	
		ОбластьСтрокаДополнительная = Макет.ПолучитьОбласть("Строка|Дополнительная");
		СуммаНачальныйОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;
		ОбластьСтрокаДополнительная.Параметры.Сумма = СуммаНачальныйОстаток;
		
		ТабДок.Присоединить(ОбластьСтрокаДополнительная);    
		ТекДата = ТекДата + 86400;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Взаиморасчеты.Период КАК Период,
		|	Взаиморасчеты.Регистратор КАК Регистратор,
		|	Взаиморасчеты.Контрагент КАК Контрагент,
		|	Взаиморасчеты.Договор КАК Договор,
		|	Взаиморасчеты.Статья КАК Статья,
		|	Взаиморасчеты.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
		|ГДЕ
		|	Взаиморасчеты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Статья,
		|	Контрагент,
		|	Договор,
		|	Регистратор,
		|	Период";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ЗАпрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтатья = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатья.Следующий() Цикл
		ОбластьСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
        ОбластьСтрокаДополнительная = Макет.ПолучитьОбласть("Строка|Дополнительная");
		
		ОбластьСтрокаОсновная.Параметры.ВидОперации = ВыборкаСтатья.Статья;
		ТабДок.Вывести(ОбластьСтрокаОсновная);
		
	
		ВыборкаКонтрагент = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаКонтрагент.Следующий() Цикл 
			ОбластьСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
			ОбластьСтрокаОсновная.Параметры.Контрагент = ВыборкаКонтрагент.Контрагент;
			
			ТабДок.Вывести(ОбластьСтрокаОсновная);
			
			// Вставить обработку выборки ВыборкаКонтрагент
	
			ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаДоговор.Следующий() Цикл 
				
				ОбластьСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
				ОбластьСтрокаОсновная.Параметры.Договор = ВыборкаДоговор.Договор;
				
				ТабДок.Вывести(ОбластьСтрокаОсновная);

				// Вставить обработку выборки ВыборкаДоговор
				ВыборкаРегистратор = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
				Пока ВыборкаРегистратор.Следующий() Цикл 
					ОбластьСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
					ОбластьСтрокаОсновная.Параметры.Договор = ВыборкаРегистратор.Регистратор;
					
					ТабДок.Вывести(ОбластьСтрокаОсновная);
					
					// Вставить обработку выборки ВыборкаРегистратор
	
					ВыборкаПериод = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
					Пока ВыборкаПериод.Следующий() Цикл
						ТекДата = ДатаНачала;
						Пока ТекДата < ВыборкаПериод.Период Цикл
							ОбластьСтрокаДополнительная = Макет.ПолучитьОбласть("Строка|Дополнительная");
							ТабДок.Присоединить(ОбластьСтрокаДополнительная);
							ТекДата = ТекДата + 86400;
						КонецЦикла;
						ОбластьСтрокаДополнительная = Макет.ПолучитьОбласть("Строка|Дополнительная");
						ОбластьСтрокаДополнительная.Параметры.Сумма = ВыборкаПериод.Сумма;
						
						ТабДок.Присоединить(ОбластьСтрокаДополнительная);
						// Вставить обработку выборки ВыборкаПериод
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ОбластьСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
	ОбластьСтрокаОсновная.Параметры.ВидОперации = "Остаток на конец";
	
	ТабДок.Вывести(ОбластьСтрокаОсновная);
    // Заполняем последнюю строку - Остаток на конец.
	// Не придумал другого варианта, кроме запроса в цикле для этого.
    ТекДата = КонецДня(ДатаНачала);
	Пока ТекДата <= ДатаОкончания Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВзаиморасчетыОстатки.СуммаОстаток) КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.Взаиморасчеты.Остатки(&ДатаНачала, ) КАК ВзаиморасчетыОстатки";
		
		Запрос.УстановитьПараметр("ДатаНачала", ТекДата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		СуммаНачальныйОстаток = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СуммаНачальныйОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;
		КонецЦикла;
	
		ОбластьСтрокаДополнительная = Макет.ПолучитьОбласть("Строка|Дополнительная");
		СуммаНачальныйОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;
		ОбластьСтрокаДополнительная.Параметры.Сумма = СуммаНачальныйОстаток;
		
		ТабДок.Присоединить(ОбластьСтрокаДополнительная);    
		ТекДата = ТекДата + 86400;
	КонецЦикла;

	
	
	Возврат ТабДок;
КонецФункции
